In [17]:
import pandas as pd
serie=pd.Series(42,index=list(range(4)))
display(serie)

0    42
1    42
2    42
3    42
dtype: int64

In [21]:
data = {'Name':['Tom', 'Jack', 'Steve', 'Ricky'],'Age':[28,34,29,42]}
df = pd.DataFrame(data, index=['rank1','rank2','rank3','rank4'])
print(df)
print(df.values)
print(df.describe())

        Name  Age
rank1    Tom   28
rank2   Jack   34
rank3  Steve   29
rank4  Ricky   42
[['Tom' 28]
 ['Jack' 34]
 ['Steve' 29]
 ['Ricky' 42]]
             Age
count   4.000000
mean   33.250000
std     6.396614
min    28.000000
25%    28.750000
50%    31.500000
75%    36.000000
max    42.000000

In [22]:
display(df.T)

     rank1 rank2  rank3  rank4
Name   Tom  Jack  Steve  Ricky
Age     28    34     29     42

### Ordenacion

In [26]:
df.sort_values(by=['Age'],ascending=False)

        Name  Age
rank4  Ricky   42
rank2   Jack   34
rank3  Steve   29
rank1    Tom   28

In [30]:
display(df[1:2])
display(df[2:6])
display(df['rank2':'rank4'])

       Name  Age
rank2  Jack   34

        Name  Age
rank3  Steve   29
rank4  Ricky   42

        Name  Age
rank2   Jack   34
rank3  Steve   29
rank4  Ricky   42

In [39]:
display(df.loc['rank1'])
display(df.loc[:,'Name'])

Name    Tom
Age      28
Name: rank1, dtype: object

rank1      Tom
rank2     Jack
rank3    Steve
rank4    Ricky
Name: Name, dtype: object

In [40]:
display(df.iloc[0:1])

      Name  Age
rank1  Tom   28

In [45]:
display(df[df['Age']>29])
display(df[df['Name']>'Jack'])

        Name  Age
rank2   Jack   34
rank4  Ricky   42

        Name  Age
rank1    Tom   28
rank3  Steve   29
rank4  Ricky   42